<a href="https://colab.research.google.com/github/anko191/Python_Kaggle/blob/master/pandas_Select_and_Extract_on_the_Condition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Select and Extract rows, columns and elements on the condition

In [ ]:
import pandas as pd
df = pd.read_csv('./sample_pandas_normal.csv')
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## numexpr
## !pip install numexpr if data the ten thousand over

## Comparison operator

In [ ]:
print(df[df['age'] < 25])

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

## in query mode

In [ ]:
print(df.query('age < 25'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

## not

In [ ]:
print(df.query('not age < 25'))

    name  age state  point
1    Bob   42    CA     92
3   Dave   68    TX     70
5  Frank   30    NY     57

## can compare one column with another column

In [ ]:
print(df.query('24 <= age < 50'))
print(df.query('age < point / 3'))

    name  age state  point
0  Alice   24    NY     64
1    Bob   42    CA     92
4  Ellen   24    CA     88
5  Frank   30    NY     57
      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

== and !=

In [ ]:
print(df.query('state == "CA"'))
print(df.query('state != "CA"'))

      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

## "in" operation
isin() function

In [ ]:
print(df[df['state'].isin(['NY','TX'])])

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

## in query method can use "in"

In [ ]:
print(df.query('state in ["NY","TX"]'))

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

In [ ]:
print(df.query('state == ["NY", "TX"]'))

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

## Conditional designation in "string method"
* str.contains() : including certain string 
* str.endswith() : end
* str.startswith() : start
* str.match() : matches the pattern of the regular expression

In [ ]:
print(df.query('name.str.endswith("e")', engine = 'python'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
3     Dave   68    TX     70

In [ ]:
print(df.query('name.str.contains("li")', engine = 'python'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [ ]:
print(df.query('name.str.match(".*i.*e")', engine = 'python'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [ ]:
print(df.query('age.astype("str").str.endswith("8")', engine = 'python'))

      name  age state  point
2  Charlie   18    CA     70
3     Dave   68    TX     70

## Note when there is a missing value NaN

In [ ]:
df.at[0,'name'] = None

In [ ]:
print(df)

      name  age state  point
0     None   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [ ]:
print(df[df['name'].str.endswith('e', na = False)]) # NaN is not contained

      name  age state  point
2  Charlie   18    CA     70
3     Dave   68    TX     70

In [ ]:
df['name'].fillna('Alice', inplace = True)
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## to index columns
"index"

In [ ]:
print(df.query('index % 2 == 0'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

## set_index()

In [ ]:
df_name = df.set_index('name')
print(df_name)

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [ ]:
print(df_name.query('name.str.endswith("e")', engine = 'python'))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Dave      68    TX     70

In [ ]:
print(df_name.query('index.str.endswith("e")', engine = 'python'))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Dave      68    TX     70

## use "variable numerics"
using "@" !!

In [ ]:
val = 80
print(df.query('point > @val'))

    name  age state  point
1    Bob   42    CA     92
4  Ellen   24    CA     88

### multiple condition & or |

In [ ]:
print(df[(df['age'] < 25) & (df['point'] > 65)])

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [ ]:
print(df.query('age < 25 & point > 65'))
print(df.query('age < 25 and point > 65'))

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88
      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [ ]:
print(df.query('age < 25 | point > 65'))
print(df.query('age < 25 or point > 65'))

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88

In [ ]:
print(df.query('not age < 25 and not point > 65'))
print(df.query('age == 24 | point > 80 & state == "CA"'))
print(df.query('(age == 24 | point > 80) & state == "CA"'))

    name  age state  point
5  Frank   30    NY     57
    name  age state  point
0  Alice   24    NY     64
1    Bob   42    CA     92
4  Ellen   24    CA     88
    name  age state  point
1    Bob   42    CA     92
4  Ellen   24    CA     88

## Notes on the query method

In [ ]:
df.columns = ['名前', 'age.year', 'state name', 3]
print(df)

        名前  age.year state name   3
0    Alice        24         NY  64
1      Bob        42         CA  92
2  Charlie        18         CA  70
3     Dave        68         TX  70
4    Ellen        24         CA  88
5    Frank        30         NY  57

### Japanese ok

In [ ]:
print(df.query('名前 == ["Alice", "Dave"]'))
print(df.query('名前.str.contains("li")', engine = 'python'))

      名前  age.year state name   3
0  Alice        24         NY  64
3   Dave        68         TX  70
        名前  age.year state name   3
0    Alice        24         NY  64
2  Charlie        18         CA  70

## but . and space " " containing is NG

In [ ]:
# print(df.query('age.year < 25'))
# UndefinedVariableError: name 'age' is not defined

# print(df.query('state name == "CA"'))
# SyntaxError: invalid syntax

# print(df.query('3 > 75'))
# KeyError: False

## but boolindex is ok

In [ ]:
print(df[df['age.year'] < 25])
print(df[df['state name'] == 'CA'])
print(df[df[3] > 75])

        名前  age.year state name   3
0    Alice        24         NY  64
2  Charlie        18         CA  70
4    Ellen        24         CA  88
        名前  age.year state name   3
1      Bob        42         CA  92
2  Charlie        18         CA  70
4    Ellen        24         CA  88
      名前  age.year state name   3
1    Bob        42         CA  92
4  Ellen        24         CA  88

## can change "rename()"

In [ ]:
df.rename(columns = {3:'point'}, inplace = True)
print(df)

        名前  age.year state name  point
0    Alice        24         NY     64
1      Bob        42         CA     92
2  Charlie        18         CA     70
3     Dave        68         TX     70
4    Ellen        24         CA     88
5    Frank        30         NY     57

## can use replace()

In [ ]:
df.columns = [str(s).replace(' ', '_').replace('.','_') for s in df.columns]
print(df)

        名前  age_year state_name  point
0    Alice        24         NY     64
1      Bob        42         CA     92
2  Charlie        18         CA     70
3     Dave        68         TX     70
4    Ellen        24         CA     88
5    Frank        30         NY     57

### renew in "inplace = True"

In [ ]:
df.query('age_year > 25', inplace = True)
print(df)

      名前  age_year state_name  point
1    Bob        42         CA     92
3   Dave        68         TX     70
5  Frank        30         NY     57

# Extract rows, AND, OR, NOT

In [1]:
import pandas as pd
df = pd.read_csv('/content/sample_pandas_normal.csv')
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [2]:
mask = [True, False, True, False, True, False]
df_mask = df[mask]
print(df_mask)

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [3]:
print(df['age'] < 35)
print(~(df['state'] == 'NY'))

0     True
1    False
2     True
3    False
4     True
5     True
Name: age, dtype: bool
0    False
1     True
2     True
3     True
4     True
5    False
Name: state, dtype: bool

In [4]:
print((df['age'] < 35) & ~(df['state' ] == 'NY'))

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [5]:
df_and = df[(df['age'] < 35) & ~(df['state'] == 'NY')]
print(df_and)

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [8]:
print((df['age'] < 20) | (df['point'] > 90))

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [9]:
df_or = df[(df['age'] < 20) | (df['point'] > 90)]
print(df_or)

      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70

In [10]:
import pandas as pd
df = pd.read_csv('/content/sample_pandas_normal.csv').head(3)
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70

In [11]:
mask = [True, False, True]
df_mask = df[mask]
print(df_mask)

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [12]:
print(df['state'] == 'CA')
print(df[df['state'] == 'CA'])

0    False
1     True
2     True
Name: state, dtype: bool
      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70

In [13]:
print(df['name'].str.contains('li'))

0     True
1    False
2     True
Name: name, dtype: bool

In [14]:
df_nan = df.copy()
df_nan.iloc[2,0] = float('nan')
print(df_nan)

    name  age state  point
0  Alice   24    NY     64
1    Bob   42    CA     92
2    NaN   18    CA     70

In [15]:
print(df_nan['name'].str.contains('li', na = False))

0     True
1    False
2    False
Name: name, dtype: bool

In [16]:
print(df_nan['name'].str.contains('li', na = True))

0     True
1    False
2     True
Name: name, dtype: bool

In [17]:
print(df['name'].str.contains('LI'))
# case = False dont distinguish
print(df['name'].str.contains('LI', case = False))

0    False
1    False
2    False
Name: name, dtype: bool
0     True
1    False
2     True
Name: name, dtype: bool

In [18]:
print(df['name'].str.contains('i.*e'))
print(df['name'].str.contains('i.*e', regex = False))

0     True
1    False
2     True
Name: name, dtype: bool
0    False
1    False
2    False
Name: name, dtype: bool

In [19]:
df_q = df.copy()

In [20]:
df_q.iloc[2,0] += '?'
print(df_q)
print(df_q['name'].str.contains('?', regex = False))
print(df_q['name'].str.contains('\?'))

       name  age state  point
0     Alice   24    NY     64
1       Bob   42    CA     92
2  Charlie?   18    CA     70
0    False
1    False
2     True
Name: name, dtype: bool
0    False
1    False
2     True
Name: name, dtype: bool

In [21]:
print(df['name'].str.endswith('e'))
print(df[df['name'].str.endswith('e')])

0     True
1    False
2     True
Name: name, dtype: bool
      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [22]:
print(df['name'].str.startswith('B'))
print(df[df['name'].str.startswith('B')])

0    False
1     True
2    False
Name: name, dtype: bool
  name  age state  point
1  Bob   42    CA     92

In [23]:
print(df['name'].str.match('.*i.*e'))

0     True
1    False
2     True
Name: name, dtype: bool

In [27]:
print(df[df['name'].str.match('.*i.*e')]) # i and

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [28]:
print(df['name'].str.match('i.*e'))

0    False
1    False
2    False
Name: name, dtype: bool

In [29]:
df = pd.read_csv('/content/sample_pandas_normal.csv')

In [30]:
df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [31]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [33]:
df = df.append({'name':'Dave', 'age':68, 'state':'TX', 'point':70}, ignore_index = True)

In [34]:
df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
6     Dave   68    TX     70

In [35]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
print(df[df.duplicated()])

   name  age state  point
6  Dave   68    TX     70

In [37]:
print(df.duplicated(keep = 'last'))

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [38]:
print(df.duplicated(keep = False))

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [39]:
print(df.duplicated(subset = 'state'))

0    False
1    False
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [40]:
print(df.duplicated(subset =['state', 'point']))

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
print(df.duplicated().value_counts())

False    6
True     1
dtype: int64

In [42]:
print(df.duplicated().value_counts()[True])

1

In [43]:
print(df.duplicated(keep = False).value_counts()[True])

2

In [44]:
print(df.drop_duplicates())

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [45]:
df.drop_duplicates(subset = 'state', keep = 'last', inplace = True)
print(df)

    name  age state  point
4  Ellen   24    CA     88
5  Frank   30    NY     57
6   Dave   68    TX     70

In [46]:
df = pd.read_csv('/content/sample_pandas_normal.csv')
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [47]:
print(df.groupby('state').mean())

        age      point
state
CA     28.0  83.333333
NY     27.0  60.500000
TX     68.0  70.000000

In [48]:
print(df.groupby('state').agg(
    {'name': lambda x:','.join(x),
     'age':'mean',
     'point':'mean'}
))

                    name  age      point
state
CA     Bob,Charlie,Ellen   28  83.333333
NY           Alice,Frank   27  60.500000
TX                  Dave   68  70.000000

In [50]:
print(df.groupby('state').agg(
    {'name':list,
     'age':'mean',
     'point':'mean'}
))

                        name  age      point
state
CA     [Bob, Charlie, Ellen]   28  83.333333
NY            [Alice, Frank]   27  60.500000
TX                    [Dave]   68  70.000000

In [51]:
df = pd.DataFrame({'a':[1,2,1,3],
                   'b':[0.4,1.1,0.1,0.8],
                   'c':['X','Y','X','Z'],
                   'd':[[0,0], [0,1],[1,0],[1,1]],
                   'e':[True, True, False, True]})
df['f'] = pd.to_datetime(['2018-01-01', '2018-03-15', '2018-02-20','2018-03-15'])
print(df)

   a    b  c       d      e          f
0  1  0.4  X  [0, 0]   True 2018-01-01
1  2  1.1  Y  [0, 1]   True 2018-03-15
2  1  0.1  X  [1, 0]  False 2018-02-20
3  3  0.8  Z  [1, 1]   True 2018-03-15

In [52]:
print(df.dtypes)

a             int64
b           float64
c            object
d            object
e              bool
f    datetime64[ns]
dtype: object

In [53]:
print(df.select_dtypes(include=int))

   a
0  1
1  2
2  1
3  3

In [54]:
print(df.select_dtypes(include = [int, float, 'datetime']))

   a    b          f
0  1  0.4 2018-01-01
1  2  1.1 2018-03-15
2  1  0.1 2018-02-20
3  3  0.8 2018-03-15

In [55]:
print(df.select_dtypes(include = 'number'))

   a    b
0  1  0.4
1  2  1.1
2  1  0.1
3  3  0.8

In [56]:
print(df.select_dtypes(include = object))

   c       d
0  X  [0, 0]
1  Y  [0, 1]
2  X  [1, 0]
3  Z  [1, 1]

In [57]:
print(type(df.at[0, 'c']))

<class 'str'>

In [58]:
print(df.select_dtypes(exclude=[bool, 'datetime']))

   a    b  c       d
0  1  0.4  X  [0, 0]
1  2  1.1  Y  [0, 1]
2  1  0.1  X  [1, 0]
3  3  0.8  Z  [1, 1]

In [59]:
df = pd.read_csv('/content/sample_pandas_normal.csv', index_col = 0)
print(df)

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [60]:
print(df.index)

Index(['Alice', 'Bob', 'Charlie', 'Dave', 'Ellen', 'Frank'], dtype='object', name='name')

In [61]:
print(df.index.str.contains('li'))

[ True False  True False False False]

In [62]:
print(df[df.index.str.contains('li')])

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70

In [63]:
print(df.index.str.endswith('e'))

[ True False  True  True False False]

In [64]:
print(df.query('index.str.contains("li")', engine = 'python'))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70

In [65]:
print(df.columns)

Index(['age', 'state', 'point'], dtype='object')

In [66]:
print(df.columns.str.endswith('e'))

[ True  True False]

In [67]:
print(df.loc[:, df.columns.str.endswith('e')])

         age state
name
Alice     24    NY
Bob       42    CA
Charlie   18    CA
Dave      68    TX
Ellen     24    CA
Frank     30    NY

In [68]:
print(df.loc[df.index.str.contains('li'), df.columns.str.endswith('e')])

         age state
name
Alice     24    NY
Charlie   18    CA